app/controllers/music/favorites_controller.rb

SELECT "musics".* FROM "musics"
---
    def show
		@favorites = current_user.favorites

		@musics = Music.order(params[:sort])

SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  1 AS one FROM "musics" WHERE "musics"."user_id" = ? AND "musics"."id" = ? LIMIT ?  [["user_id", 14], ["id", 20], ["LIMIT", 1]]
SELECT  1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."music_id" = ? LIMIT ?  [["user_id", 1], ["music_id", 7], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "music_id") VALUES (?, ?)  [["user_id", 1], ["music_id", 7]]
---
	def update
		@music = Music.find(params[:id_music])
		if (current_user.favorites.where(music: @music).empty?)
			@favorite = Favorite.create!(:user => current_user, :music => @music)

SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "musics".* FROM "musics" WHERE "musics"."user_id" = ? AND "musics"."id" = ? LIMIT ?  [["user_id", 2], ["id", 21], ["LIMIT", 1]]
SELECT  1 AS one FROM "musics" WHERE "musics"."user_id" = ? AND "musics"."id" = ? LIMIT ?  [["user_id", 2], ["id", 21], ["LIMIT", 1]]
SELECT  1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."music_id" = ? LIMIT ?  [["user_id", 1], ["music_id", 7], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."music_id" = ?  [["user_id", 1], ["music_id", 20]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 2]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."music_id" = ?  [["user_id", 1], ["music_id", 7]]
---
	def destroy
		@music = Music.find(params[:id_music])
		@list = current_user.favorites
		if (!@list.where(music: @music).empty?)
			@list.where(music: @music).destroy_all