app/views/music/show.html.haml

SELECT  1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."music_id" = ? LIMIT ?  [["user_id", 2], ["music_id", 20], ["LIMIT", 1]]
---
		#{link_to 'Back to track list', music_index_path, :style=>'text-decoration: none;'}
	- if ((user_signed_in?) && (!current_user.favorites.where(music: @music).empty?))