app/controllers/music_controller.rb

	def index
		if (params[:search] && params[:search]!= "")

			if (params[:type] == "Title")
				@musics = Music.where(title: params[:search])
			elsif (params[:type] == "Artist")
				@musics = Music.where(author: params[:search])
			elsif (params[:type] == "Album")
				@musics = Music.where(album: params[:search])
			elsif (params[:type] == "Year")
				@musics = Music.where(Year: params[:search])
			end

		else
			@musics = Music.all
		end

		if (params[:sort])
			@musics = @musics.order(params[:sort])
---
SELECT  "musics".* FROM "musics" WHERE "musics"."title" = ? LIMIT ?  [["title", "smoke"], ["LIMIT", 1]]
SELECT "musics".* FROM "musics" WHERE "musics"."author" = ?  [["author", "Thunderstruck"]]
SELECT "musics".* FROM "musics" WHERE "musics"."album" = ?  [["album", "AC/DC"]]
SELECT "musics".* FROM "musics" WHERE "musics"."Year" = ?  [["Year", "2020"]]
SELECT "musics".* FROM "musics"

	def create
		if !(Music.exists?(:title=>params[:music][:title], :author=>params[:music][:author], :genre=>params[:music][:genre], :year=>params[:music][:year]))
---
SELECT "musics".* FROM "musics"
SELECT  1 AS one FROM "musics" WHERE "musics"."title" = ? AND "musics"."author" = ? AND "musics"."genre" = ? AND "musics"."year" = ? LIMIT ?  [["title", "Prova"], ["author", "Prova1"], ["genre", "Rock"], ["year", "2020"], ["LIMIT", 1]]

			#authorize! :create, @music, :message => "Attenzione: Non sei autorizzato a creare nuovi brani"
			params[:music].merge!(user_id: current_user.id)

			@music = Music.create!(params[:music].permit(:title,:author,:album,:genre,:year, :user_id))
			@music.update_attribute(:image_url, @album)
			@music.update_attribute(:preview_id, @id_music)
---
INSERT INTO "musics" ("title", "author", "album", "genre", "year", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "musics" SET "updated_at" = ?, "preview_id" = ? WHERE "musics"."id" = ?  [["updated_at", "2020-06-08 14:48:10.243436"], ["preview_id", "08zmYjBwIXlHmv4yALg6e8"], ["id", 19]]
UPDATE "musics" SET "year" = ?, "updated_at" = ? WHERE "musics"."id" = ?  [["year", "1990"], ["updated_at", "2020-05-30 19:12:47.746450"], ["id", 4]]

	def show
        id = params[:id]
        if Music.exists?(id)
			@music = Music.find(id)
			@reviews = Review.where(:music_id=>id)
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."music_id" = ?  [["music_id", 1]]

	def destroy
		id = params[:id]
		@music = Music.find(id)
		authorize! :destroy, @music, :message => "Attenzione: Non sei autorizzato ad eliminare brani"
		@music.destroy
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "musics" WHERE "musics"."id" = ?  [["id", 27]]

	def update
        id = params[:id]
		@music = Music.find(id)
		authorize! :update, @music, :message => "Attenzione: Non sei autorizzato ad aggiornare brani"
		@music.update_attributes!(params[:music].permit(:title, :author, :album, :genre, :year))

		#	Cambio Album Cover + ID per preview Spotify
		uri = URI ('https://api.spotify.com/v1/search')
		http = Net::HTTP.new(uri.host, uri.port)
		@tok_spotify = getToken
		header_auth = "Bearer " + @tok_spotify
		http.use_ssl=true
		data = {
			:q => "album:" + params[:music][:album] + " artist:" + params[:music][:author] + " track:" + params[:music][:title],
			:type => "track",
			:market => "US"
		}
		uri.query = URI.encode_www_form(data).gsub("+","%20")
		request = Net::HTTP::Get.new(uri, {'Authorization' => header_auth})
		@response = http.request(request)
		@response = JSON.parse(@response.body)

		if (@response["tracks"]["total"] == 0)
			@album = "https://img.bhs4.com/2a/0/2a05500a3a3ef626426fbca6efb69017863992af_large.jpg"
		else
			@album = @response["tracks"]["items"][0]["album"]["images"][0]["url"]
			@id_music = @response["tracks"]["items"][0]["id"]
		end
		@music.update_attribute(:image_url, @album)
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "musics" SET "title" = ?, "author" = ?, "album" = ?, "updated_at" = ? WHERE "musics"."id" = ?  [["title", "modifica"], ["author", "modifica"], ["album", "modifica"], ["updated_at", "2020-06-01 14:43:35.377951"], ["id", 3]]
UPDATE "musics" SET "updated_at" = ?, "preview_id" = ? WHERE "musics"."id" = ?  [["updated_at", "2020-06-06 00:27:20.071900"], ["preview_id", "3Zwu2K0Qa5sT6teCCHPShP"], ["id", 18]]

	def edit
		if !user_signed_in?
			redirect_to new_user_session_path()
		end

		id = params[:id]
		@music = Music.find(id)
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]