app/controllers/music_controller.rb

	def create
		if !(Music.exists?(:title=>params[:music][:title], :author=>params[:music][:author], :genre=>params[:music][:genre], :year=>params[:music][:year]))
			@music = Music.create!(params[:music].permit(:title,:author,:album,:genre,:year))
---
SELECT  1 AS one FROM "musics" WHERE "musics"."title" = ? AND "musics"."author" = ? AND "musics"."genre" = ? AND "musics"."year" = ? LIMIT ?  [["title", "traccia"], ["author", "un tipo"], ["genre", "Rock"], ["year", "1989"], ["LIMIT", 1]]
INSERT INTO "musics" ("title", "author", "album", "genre", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "traccia"], ["author", "un tipo"], ["album", "un disco"], ["genre", "Rock"], ["year", "1989"], ["created_at", "2020-05-29 16:05:08.251749"], ["updated_at", "2020-05-29 16:05:08.251749"]]

	def show
        id = params[:id]
        if Music.exists?(id)
				@music = Music.find(id)
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def destroy
		id = params[:id]
		@music = Music.find(id)
		authorize! :destroy, @music, :message => "Attenzione: Non sei autorizzato ad eliminare brani"
		@music.destroy
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "musics" WHERE "musics"."id" = ?  [["id", 1]]

	def update
        id = params[:id]
		@music = Music.find(id)
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		id = params[:id]
		@music = Music.find(id)
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]