app/controllers/reviews_controller.rb

	def create
		music_id = params[:music_id]
		user_id = current_user.id
		@music = Music.find(music_id)
		@review = Review.new(params[:review].permit(:musicman, :comments))
		authorize! :create, @review, :message => "Attenzione: Non sei autorizzato a creare una recensione"
		@review.user_id = user_id
		@review.music_id = music_id
		@review.save!
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("musicman", "comments", "user_id", "music_id") VALUES (?, ?, ?, ?)  [["musicman", 1], ["comments", "awd"], ["user_id", 1], ["music_id", 1]]

	def destroy
		id = params[:music_id]
		@review = Review.find(id)
		authorize! :destroy, @review, :message => "Attenzione: Non sei autorizzato ad eliminare una recensione"
		@review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 2]]

	def update
        id = params[:music_id]
		@review = Review.find(id)
		@review.update_attributes!(params[:review].permit(:musicman, :comments))
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "comments" = ? WHERE "reviews"."id" = ?  [["comments", "Commento 1 modificato"], ["id", 4]]

	def edit
		if !user_signed_in?
			redirect_to new_user_session_path()
		end
		id = params[:music_id]
		@review = Review.find(id)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]