app/controllers/user_controller.rb

    def update
        @user = User.find(params[:id])
        @user.update_attributes!(params.permit(:roles_mask))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "roles_mask" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["roles_mask", 1], ["updated_at", "2020-06-06 00:34:06.936411"], ["id", 1]]