app/models/music.rb

SELECT  "musics".* FROM "musics" WHERE "musics"."title" = ? LIMIT ?  [["title", "smoke"], ["LIMIT", 1]]
SELECT  "musics".* FROM "musics" WHERE "musics"."track" = ? LIMIT ?  [["track", "smoke"], ["LIMIT", 1]]
---
	def self.search(search)
		if search
			track = Music.find_by(title: search)
				if track
					self.where(music_id: track)
				else
					@tracks = Music.all