app/models/user.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "provider", "uid") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "facebook"], ["uid", "2957085504329190"], ["LIMIT", 1]]
---
  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|

SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "foxyseta1@gmail.com"], ["LIMIT", 1]]
---
  def self.new_with_session(params, session)
    super.tap do |user|
      if data = session["devise.facebook_data"] && session["devise.facebook_data"]["extra"]["raw_info"]
        user.email = data["email"] if user.email.blank?